In [2]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.499866 -2.739715
1    a  two  0.327311 -0.079655
2    b  one -0.156558  0.785289
3    b  two -0.498169  0.164373
4    a  one -1.189529  0.965645

In [4]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.120784 -0.617908
b    -0.327363  0.474831

In [5]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.499866 -2.739715
1    a  two  0.327311 -0.079655
4    a  one -1.189529  0.965645
b
  key1 key2     data1     data2
2    b  one -0.156558  0.785289
3    b  two -0.498169  0.164373

In [10]:
data = dict(list([('t','taiwan'),('j','japan')]))
data['t']

'taiwan'

In [11]:
data1 = dict(list(df.groupby('key1')))
data1['a']

  key1 key2     data1     data2
0    a  one  0.499866 -2.739715
1    a  two  0.327311 -0.079655
4    a  one -1.189529  0.965645

In [12]:
data1['b']

  key1 key2     data1     data2
2    b  one -0.156558  0.785289
3    b  two -0.498169  0.164373

In [13]:
df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  1.436947  0.395812
1    a  two -0.413699 -0.158014
2    b  one -0.104568  0.217636
3    b  two  1.305430 -0.056489
4    a  one -0.769700 -0.349228

In [18]:
#df['data1'].groupby(df['key1'])
df.groupby('key1')['data1'].mean()

key1
a    0.084516
b    0.600431
Name: data1, dtype: float64

In [19]:
df.groupby('key1')[['data1']].mean()

         data1
key1
a     0.084516
b     0.600431

In [20]:
df.groupby('key1')[['data1','data2']].mean()

         data1     data2
key1
a     0.084516 -0.037143
b     0.600431  0.080573